---
kind: other
id: Properties.T:Autodesk.Revit.UI.ExternalCommandData
source: html/4654a366-ba32-4d50-3b55-8cb3c593b132.htm
---
# ExternalCommandData Properties

Retrieves an object that represents the current Application for
external command.